{
  "Intents": [
    {
      "tag": "age",
      "patterns": [ "كم عمرك ؟ ", "قداش عمرك؟" ],
      "responses": [ "لقد تمت برمجتي من قبل ملاك يعيش و محمد امين اللحياني يوم 1 ماي 2023 كجزء من مشروع اكاديمي.اتم اليوم اذا يومي السادس " ]
    },
    {
      "tag": "greeting",
      "patterns": [ "صباح النور", "مرحبا", "سلام علیکم", "أهلاً", "صباح الخير" ,"سلام"],
      "responses": [ "عسلامة، أنا الدكتور حكيم. كيفلش نجم نعاونك؟", "سلام، انا الدكتور حكيم يمكنك طرح اي استشارة طبية ", " مرحبا بيك، ماهو سؤالك اليوم ؟", "صباح الخير،الدكتور حكيم حاضر لاي سؤال " ]
    },
    {
      "tag": "goodbye",
      "patterns": [ "شكرا", "مع السلامة" ],
      "responses": [ "سررت بمساعتك", "اتمنى ان تكون قد استفدت من الاجابة، بااي  " ]
    },
    {
      "tag": "name",
      "patterns": [ "ماهو اسمك؟", "من انت؟", "ماهي وظيفتك؟" ],
      "responses": [ "أنا الدكتور حكيم، روبوت دردشة. وظيفتي هي تقديم نصائح طبية لك" ]
    },
    {
      "tag": "الامتحان",
      "patterns": [ "انا قلقة من الإمتحان", "من فضلكم كيف أتخلص من التوتر والخوف في الامتحان", "كيف اتغلب على توتر الامتحان ؟" ,"لدي امتحان غدا وانا خائفة جدا","انا خائفة من الامتحان ","عند قرب الامتحان اشعر بخوف شديد و انسى كل ما راجعته"],
      "responses": [ "جرب ممارسة تمارين الاسترخاء والتنفس العميق مع تجنب الاكثار من المنبهات وتنظيم وقت الدراسة ووضع استراحة بشكل دوري بين ساعات الدراسة", "'التوتر السابق للامتحانات أمر مقبول بل وصحي، لأن لو لم يكن هناك توتر قبل الامتحان لما كان هناك حافز للمذاكرة، لكن المشكلة حين يزيد التوتر عن تحمل الشخص فيعوقه عن الاستذكار..في هذه الحالة يجب تقييمك من قبل طبيب نفسي لوصف العلاج المناسب لحالتك، وهو علاج بسيط ويمكن التوقف عنه بمجرد انتهاء الامتحانات" ]
    },
    {
      "tag": "ارق",
      "patterns": [ "اشعر دائما بل اختناق وأفكر دائماً بي اشياء قد تزعجني أتمنى التخلص من هاذا الشي وشكرا ؟!", "لدي مشكلة في التركيز وكثيراً ما أكون سرحان " ,"لا استطيع النوم بشكل جيد","اعاني من اضطرابات في النوم"],
      "responses": [ "تحتاج التنظيم نمطك اليومي ومن ثم التدرب على تمارين السيطرة على النفس" ]

    },
    {
      "tag": "autre",
      "patterns": [ " " ],
      "responses": [ "ممكن ان توصفي وضعك بشكل ادق", "تحتاج لمراجعة اقرب عيادة نفسية لتقييم حالتك", "تحتاج لمزيد من التشخيص لدى متخصص لمعرفة تفاصيل عن الحالة ومدتها وبناءا على ذلك تحتاج لمعالجة نفسيه مرتبطة بطبيعة حالتك ومدى شدتها", "ما هي المشكله التي تعاني منها" ]
    },
    {
      "tag": "الوسواس",
      "patterns": [ "ما علاج الوسواس القهري", " لدي وسواس من الأمراض وانا كثيرة التفكير فيها", "منذ عامان شعور بكرة للحياة بعد مشكلة معي ثم بدائت اتوسوس باني اصبت بمرض معين ثم رجعت عن هذة الوسوسة ثم اصبت فعلا بربو الصدر لذالك اشعر دائما بالحزن والمزاجية الشديدة، ما الحل؟", "لدي وسواس قهري بالافكار والتخيلات ", "تعاني منذ سنتين من الوسواس القهري ماعلاجه" ],
      "responses": [ "هنالك طرق عدة لعلاج الوسواس القهري كالعلاج السلوكي المعرفي وهو يتم بدون أدوية ولكن في بعض الحالات تستدعي الحالة أدوية .لكن عليك مراجعة اخصائي او طبيب نفسي للتأكد من انك تعاني من اضطراب الوسواس القهري فربما يكون تشخيصك مختلف عن ذلك", "يعتمد ذلك على فهم الأعراض بشكل شامل والتشخيص الصحيح للحالة ومن ثم ستضمنين ايجاد العلاج المناسب" ]
    },
    {
      "tag": "الرهاب الاجتماعي",
      "patterns": [ "دايما حاسة اني لوحدي والناس كلها جاية عليا", "لدي مشاكل أخرى كالقلق والوسواس والرهاب الإجتماعي", "الخوف من مواجهة ومخاطبة الناس", "ماذا افعل لكى اتخلص من افكارى السيئه تجاه الاخرين وشكوكى الزائده بها وشعورى الدائم بانى مريضه نفسيا", "ماسبب عدم الثقه بالاخرين والشعور السلبي", "مش بعرف اتعامل مع الناس وبتظلم كتير في حياتي من اقرب الناس ليا وبقيت بكرهم", "أشعر بوتر وخجل عندما أتعامل مع الاخرين" ],
      "responses": [ "السؤال يعطي بعض الاعراض التي قد تعد طبيعية في مرحلة عمرية معينة و لفترة قصيرة , و لكن اذا كانت هذه الاعراض ممتدة و تؤثر على الاداء الوظيفي للشخص و علاقاته بمجتمعه و تستهلك معظم وقته هنا يجب البحث عن علاج. الاعراض المذكورة لو افترضنا انها الاحساس بالوحدة و الحزن و كراهية الناس و هذا ممتد لفترة طويلة تزيد عن الاسبوعين و تستهلك تفكير و اداء الشخص معظم الوقت فقد يكون ذلك اكتئابا و قد تكون اعراض للقلق. تقلب المزاج قد يكون سمة شخصية و قد يكون عرض لمرض المهم مدة تقلب المزاج و استمراريته, ان يري الشخص انه غير جميل قد يكون عرضا اخر لمرض اخر المهم ما تيرتب على ذلك , يجب مراجعة طبيب نفسي للتشخيص و العلاج'", "الباروكستين هو العلاج الانسب للرهاب الاجتماعي والقلق....لكن انصحك بأن تزور طبيبا نفسيا ليقيم حالتك ويصرف لكالعلاج المناسب لحالتك", "تمرينات اثبات الذات تفيد في مثل حالتك بعد استكمال التشخيص", "'انت تعاني من تدني بالثقه بالنفس وتقييمك السي لذاتك فعليك العمل على تقويتها", "اذا لم يكن هناك اعراض اخرى فانت تحتاجين الى تمارين التدرب على الثقة بالنفس واثبات الذات", "قد تعاني من اضطراب الرهاب الاجتماعي، أنصحك بزيارة طبيب نفسي لتقييم حالتك بدقة ووصف العلاج المناسب" ]
    },
    {
      "tag": "الحياة",
      "patterns": [ "اخاف الجلوس لوحدي في البيت. لدي محاولات بالانتحار. اشعر باليأس و الحزن الشديد", "لقد وصلت لمرحلة التفكير في الموت على الدوام", "الخوف من المستقبل وتشويش بالذهن والرغبة في بعض الاحيان التخلص من الحياة " ],
      "responses": [ "تدريبات الثقة بالنفس مفيدة لمثل حالاتك", "من المفيد لك ان تتدربي على التفكير الايجابي تذكري ( تفائلوا بالخير تجدوه )", "تستطيع ان تستفيد من الجوانب الايمانيه في حياتك لرفع الروح المعنوية عندك و التغلب على الاكتئاب وانت بحاجة الى ان تراجع معالجا قريبا منك لكي تستفيد اكثر من التشخيص الدقيق ومن الخدمات العلاجية تبعا لذلك'", "  تستطيع ان تستفيد من الجوانب الايمانيه في حياتك لرفع الثقة بالنفس وبالاخرين وذلك سيساعد في التغلب على الاكتئاب والخوف" ]
    },
    {
      "tag": "والاكتئاب",
      "patterns": [ "اني من كثرة الحزن والتفكير السلبي في اكثر الاوقات ونادرا ما افرح ", "دائما اشع بالاكتئاب والاحباط والخوف", "للتخلص من الاكتئاب و الضيق", "اشعر دائما بل اختناق وأفكر دائماً بي اشياء قد تزعجني أتمنى التخلص من هاذا الشي", "اعاني من الحالة النفسية السيئة و والاكتئاب و الهم و الحزن", "انا اشعر بالحزن والوحدة والملل طوال حيات" ],
      "responses": [ "قد تكون هذه اعراض للشخصية الاكتئابية او الاكتئاب او غيره ويعتمد التشخيص على طول المدة الزمنية التي حدثت بها الاعراض اضافة الى تواجد اعراض اخرى لديك", "من المفيد الاعتناء بتغيير نمط الحياه واسلوب التفكير والعمل على تعديله من خلال تعلم مهارات التعامل مع الضغوط ومهارات التوازن في تخطيط نمط الحياه بين الجوانب الاجتماعية والنفسية الجادة والترفيهية والجوانب الصحية والجوانب الروحانية وفي حال عدم الاستجابة للتحسن يمكن الانسان ان يراجع المعالج بالقرب منه ", "تذكري ( تفائلوا بالخير تجدوه ) من المفيد لك ان تتدربي على التفكير الايجابي", "تحتاجين ان تمارسي تمرين الاسترخاء والتفكر الارتقائي\r\nكما ان في سن السابعة عشر هو سن تغيرات تحتاجين لتنمية مواهب واكتشاف مهاراتك الشخصيه\r\nكما تحتاجين الى تنظيم نمط الحياة اليومية\r\nوبعد اسبوع ضعي تقيميا لحالتك وارسليه", "تستطيع ان تستفيد من الجوانب الايمانيه في حياتك لرفع الثقة بالنفس وبالاخرين وذلك سيساعد في التغلب على الاكتئاب والخوق وانت بحاجة الى ان تراجع معالجا قريبا منك لكي تستفيد اكثر من التشخيص الدقيق ومن الخدمات العلاجية تبعا لذلك", "تحتاج حالتك الى ان يكون لديك رغبة في التغيير وتحمل المسؤليه عمليا\r\nوتحتاج لتنظيم نمط حياتك والمثابرة عليه بشكل متوازن\r\nومن المهم مراجعة الطبيب" ]

    },
    {
      "tag": "الذهان التأخري",
      "patterns": [ "ما هو(الذهان التأخري)؟ وشكرا" ],
      "responses": [ "الذهان: هو مرض يطلق على الحالات العقلية التي تصيب الإنسان والتي يحدث فيها خلل ضمن التفكير المنطقي ، أو في الإدراك الحسي عنده، فهو حالة من فقدان الاتصال مع الواقع، وأبرز ما يميز مرض الذهان بأن الأشخاص المصابين به يصابون بنوبات من الهلوسة، وتمسكهم بمعتقدات وهمية. هناك العديد من الاضطرابات الذهانية التي يمكن ان تصيب الانسان و من اشهرها الفصام العقلي" ]

    },

    {
      "tag": "الفراق",
      "patterns": [ "اني تركت شخصا احببته كثيرا وانا اعاني من مشكلات في حياتي وانهيار احلامي امامي" ],
      "responses": [ "ستندمل هذه الجراح مع الوقت ولكن المهم الا تصري علي تذكره دائما لان هذا ادمان .فان احببتي العودة الي طبيعتك السابقه عليكي ان تقلعي عنه" ]

    },
    {
      "tag": "صدمة",
      "patterns": [ "توفي ابي منذ مدة لكني لم استطيع البكاء ابدا فى الاول قلت يمكن تكون من الصدمة لكن الان احاول ان اتذكر كلامه او شيىء يخصه لا استطيع اشعر انه حلم انا اعيش كانه لم يكن في حياتي", "كيف يستطيع الانسان ان يتخلص من تاثير صدمة نفسيه شديدة اصابته" ],
      "responses": [ "الصدمة تختلف حسب طبيعتها وتختلف حسب تأثيرها كما ان تاثيرها يختلف باختلاف الافراد الواقعة عليهم وحتى يكون تاثيرها اكثر قربا من الصحة النفسية يحتاج الانسان ان يقييم كل ذلك لذا من المهم اعطاء تفاصيل للمعاج ليتمكن من اعطائك الحلول الاكثر فاعلية" ]

    },

{
      "tag": "دكتور",
      "patterns": ["كيف يمكنني التحدث الى طبيب" ,"اريد التحدث الى طبيب","بمن تنصحني","كيف يمكنني اخذ موعد عند طبيب","ساعدني فاخذ موعد عند الطبيب" ],
      "responses": [ "بالطبع، الدكتورة عبير متخصصة في مثل هذه الامراض النفسية يمكنك التواصل معها عبر البريد الالكتروني او الاتصال على الرقم : 22 567 456"]

    }



  ]
}
